#Задание 29.
#В каких директориях python ищет модули по умолчанию?
# Корневая директория
# Домашняя директория программы
# На рабочем столе

#Ответ:В Домашняя директория программы

#Задание 30.
#Модулем на языке Python является
# Любой текстовый файл с инструкциями на языке Python с расширением .py
# Любой текстовый файл с инструкциями на языке Python
# Любой текстовый файл с инструкциями на языке Python с расширением .pyс

#Ответ: Любой текстовый файл с инструкциями на языке Python с расширением .py


