mass = [7.713, 0.208, 6.336, 7.488, 4.985, 2.248, 1.981, 7.605, 1.691, 0.883, 6.854, 9.534, 0.039, 5.122,
        8.126, 6.125, 7.218, 2.919, 9.178, 7.146, 5.425, 1.422, 3.733, 6.741, 4.418]
max_int = max(mass)
print(f"максимальная интенсивность на всём промежутке {max_int}")

int_10 = mass[:10] 
max_int_10 = max(int_10)
print(f"максимальная интенсивность на промежутке в 10 с {max_int_10}")
time = mass.index(max_int_10)
print(f"время наблюдения максимальной интесивности в первые 10 секунд {time}с")